src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак наличия записи в регистре по переданному отбору.
//
// Параметры:
//   СтруктураЗаписи - Структура:
//     * УзелИнформационнойБазы - ПланОбменаСсылка - узел плана обмена.
//     * Ссылка - ДокументСсылка
//              - ПланВидовХарактеристикСсылка
//              - СправочникСсылка - ссылка на объект.
//
// Возвращаемое значение:
//   Булево - Истина, если в регистре содержатся записи для заданного отбора.
//
Функция ЗаписьЕстьВРегистре(СтруктураЗаписи) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗапись
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК РПИ
	|ГДЕ
	|	РПИ.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И РПИ.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", СтруктураЗаписи.УзелИнформационнойБазы);
	Запрос.УстановитьПараметр("Ссылка",                 СтруктураЗаписи.Ссылка);
	
	Если СтруктураЗаписи.Свойство("ОбъектФормата")
		И НЕ ПустаяСтрока(СтруктураЗаписи.ОбъектФормата) Тогда
		
		Запрос.Текст = Запрос.Текст + Символы.ПС +
			"И (РПИ.ОбъектФормата = &ОбъектФормата ИЛИ РПИ.ОбъектФормата = """")";
		
		Запрос.УстановитьПараметр("ОбъектФормата", СтруктураЗаписи.ОбъектФормата);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Преобразует ссылку на объект текущей информационной базы в строковое представление УИД.
// Если в регистре ПубличныеИдентификаторыСинхронизируемыхОбъектов есть такая ссылка, возвращается УИД из регистра.
// В противном случае возвращается УИД переданной ссылки.
// 
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылка - ссылка на узел плана обмена, в который происходит выгрузка данных.
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект информационной базы, для которого необходимо получить
//                   уникальный идентификатор объекта XDTO.
//  ОбъектФормата - Строка - имя объекта формата, как оно задано в формате EnterpriseData (см. пакеты XDTO).
//
// Возвращаемое значение:
//  Строка - уникальный идентификатор объекта.
//
Функция ПубличныйИдентификаторПоСсылкеОбъекта(УзелИнформационнойБазы, СсылкаНаОбъект, ОбъектФормата) Экспорт
	
	// Когда выгружаемый объект - это идентификатор, например, в случае, когда внешнюю ссылку (UID) храним отдельно.
	// Сценарий использования:
	// - для отдельной строки документа этой ИБ необходимо сформировать целостный документ в корреспонденте.
	Если ТипЗнч(СсылкаНаОбъект) = Тип("УникальныйИдентификатор") Тогда
		
		Возврат СокрЛП(СсылкаНаОбъект);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Определение публичной ссылки через ссылку на объект.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",                 СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ОбъектФормата",          ОбъектФормата);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПИСО.Идентификатор КАК Идентификатор,
	|	ВЫБОР
	|		КОГДА &ОбъектФормата <> """"
	|				И ПИСО.ОбъектФормата = &ОбъектФормата
	|			ТОГДА 1
	|		КОГДА &ОбъектФормата <> """"
	|				И ПИСО.ОбъектФормата = """"
	|			ТОГДА 2
	|		КОГДА &ОбъектФормата <> """"
	|				И ПИСО.ОбъектФормата <> &ОбъектФормата
	|			ТОГДА 4
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ПорядокВыборки
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
	|ГДЕ
	|	ПИСО.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И ПИСО.Ссылка = &Ссылка
	|	И (ПИСО.ОбъектФормата = &ОбъектФормата
	|			ИЛИ ПИСО.ОбъектФормата = """"
	|			ИЛИ &ОбъектФормата = """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокВыборки,
	|	ПИСО.Основной УБЫВ,
	|	ПИСО.Идентификатор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		
		// Если СсылкаНаОбъект сопоставлена с несколькими идентификаторами (внешними UID),
		// удалять записи не требуется. Ожидаем, что для константного возврата идентификатора
		// надо назначить его основным, в противном случае система будет сортировать список
		// и возвращать всегда первый (раннее сортировка отсутствовала).
		Выборка.Следующий();
		Возврат СокрЛП(Выборка.Идентификатор);
		
	КонецЕсли;
	
	Возврат СокрЛП(СсылкаНаОбъект.УникальныйИдентификатор());
	
КонецФункции

Функция СсылкаНаОбъектПоПубличномуИдентификатору(УзелИнформационнойБазы, ВнешняяСсылка, ОбъектФормата, ЧиститьБитые = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", ВнешняяСсылка);
	Запрос.УстановитьПараметр("ОбъектФормата", ОбъектФормата);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПИСО.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА &ОбъектФормата <> """"
		|				И ПИСО.ОбъектФормата = &ОбъектФормата
		|			ТОГДА 1
		|		КОГДА &ОбъектФормата <> """"
		|				И ПИСО.ОбъектФормата = """"
		|			ТОГДА 2
		|		КОГДА &ОбъектФормата <> """"
		|				И ПИСО.ОбъектФормата <> &ОбъектФормата
		|			ТОГДА 4
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ПорядокВыборки
		|ИЗ
		|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
		|ГДЕ
		|	ПИСО.УзелИнформационнойБазы = &УзелИнформационнойБазы
		|	И ПИСО.Идентификатор = &Идентификатор
		|	И (ПИСО.ОбъектФормата = &ОбъектФормата
		|			ИЛИ ПИСО.ОбъектФормата = """"
		|			ИЛИ &ОбъектФормата = """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокВыборки,
		|	ПИСО.Основной УБЫВ,
		|	ПИСО.Идентификатор";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	НайденныеСсылка = Новый Массив;
	БитыеСсылки = Новый Массив;
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		Если НЕ ОбщегоНазначения.СсылкаСуществует(СтрокаРезультата.Ссылка) Тогда
			
			БитыеСсылки.Добавить(СтрокаРезультата.Ссылка);
			Продолжить;
			
		КонецЕсли;
		
		НайденныеСсылка.Добавить(СтрокаРезультата.Ссылка);
		
	КонецЦикла;
	
	Если ЧиститьБитые И БитыеСсылки.Количество() > 0 Тогда
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("Идентификатор", ВнешняяСсылка);
		СтруктураЗаписи.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
		СтруктураЗаписи.Вставить("Ссылка", Неопределено);
		
		Для Каждого БитаяСсылка Из БитыеСсылки Цикл
			
			СтруктураЗаписи.Ссылка = БитаяСсылка;
			УдалитьЗапись(СтруктураЗаписи, Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НайденныеСсылка;
	
КонецФункции

Функция КоличествоОбъектовБезСоответствия(ПолноеИмяОбъектаМетаданных, УзелИнформационнойБазы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаОбъектаМетаданных.Ссылка) КАК КоличествоОбъектовБезИдентификатора
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаОбъектаМетаданных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|		ПО ТаблицаОбъектаМетаданных.Ссылка = ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка
	|			И (ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелИнформационнойБазы)
	|ГДЕ
	|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор ЕСТЬ NULL";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаДанных",  ПолноеИмяОбъектаМетаданных);
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.КоличествоОбъектовБезИдентификатора;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция НовыйДанныеЗаписи() Экспорт
	
	ДанныеЗаписи = Новый Структура;
	ДанныеЗаписи.Вставить("Идентификатор", "");
	ДанныеЗаписи.Вставить("Ссылка", Неопределено);
	ДанныеЗаписи.Вставить("УзелИнформационнойБазы", Неопределено);
	ДанныеЗаписи.Вставить("Основной", Ложь);
	ДанныеЗаписи.Вставить("ОбъектФормата", "");
	ДанныеЗаписи.Вставить("СсылкаВнешняяНавигационная", "");
	
	Возврат ДанныеЗаписи;
	
КонецФункции

Функция ДополнительныеСвойстваНабораЗаписейНеОпределятьИзменениеБлокируемыеОбъекты() Экспорт
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("НеОпределятьИзменениеОбъектыБлокирующиеЗагрузку", Истина);
	
	Возврат ДополнительныеСвойства;
	
КонецФункции

// Определяет идентификаторы, соответствующие объекту ИБ
//
// Параметры:
//  ДанныеЗаписи - Структура - содержит:
//   *УзелИнформационнойБазы  - ПланОбменаСсылка - план обмена приложения-корреспондента
//   *Ссылка                  - Произвольный - ссылка на объект информационной базы
// 
// Возвращаемое значение:
//  Массив из Строка - 
//
Функция ПубличныеИдентификаторыПриложенияСоответствующиеСсылке(ДанныеЗаписи) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПубличныеИдентификаторы.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
	|ГДЕ
	|	ПубличныеИдентификаторы.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И ПубличныеИдентификаторы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", ДанныеЗаписи.УзелИнформационнойБазы);
	Запрос.УстановитьПараметр("Ссылка",                 ДанныеЗаписи.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
		
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Идентификатор");
	
КонецФункции

Процедура ЗаполнитьОбъектФорматТекущейЗаписи(СтруктураЗаписи) Экспорт
	
	Если НЕ СтруктураЗаписи.Свойство("ОбъектФормата")
		ИЛИ НЕ ЗначениеЗаполнено(СтруктураЗаписи.ОбъектФормата) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", СтруктураЗаписи.Идентификатор);
	Запрос.УстановитьПараметр("Ссылка", СтруктураЗаписи.Ссылка);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", СтруктураЗаписи.УзелИнформационнойБазы);
	Запрос.УстановитьПараметр("ОбъектФормата", СтруктураЗаписи.ОбъектФормата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПИСО.Идентификатор КАК Идентификатор,
	|	ПИСО.Ссылка КАК Ссылка,
	|	ПИСО.УзелИнформационнойБазы КАК УзелИнформационнойБазы,
	|	ПИСО.Основной КАК Основной,
	|	ПИСО.ОбъектФормата КАК ОбъектФормата
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
	|ГДЕ
	|	ПИСО.Идентификатор = &Идентификатор
	|	И ПИСО.Ссылка = &Ссылка
	|	И ПИСО.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И ПИСО.ОбъектФормата <> &ОбъектФормата";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		ИмяРегистра = "ПубличныеИдентификаторыСинхронизируемыхОбъектов";
		ОбменДаннымиСлужебный.ОбновитьЗаписьВРегистрСведений(СтруктураЗаписи, ИмяРегистра);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьДанныеУстановленныхСоответствийПоОбъектам(ПараметрыПодготовки, АдресХранилища) Экспорт
	
	УзелИнформационнойБазы = ПараметрыПодготовки.ДанныеДляПолучения.УзелИнформационнойБазы;
	
	ДанныеСоответствий = ДанныеУстановленныхСоответствийПоОбъектам(УзелИнформационнойБазы, ПараметрыПодготовки.ДанныеДляПолучения.ИменаОбъектовМетаданных);
	
	ПоместитьВоВременноеХранилище(ДанныеСоответствий, АдресХранилища);
	
КонецПроцедуры

#Область РаботаСДанными

// Процедура добавляет запись в регистр по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - см. структуру регистра "ПубличныеИдентификаторыСинхронизируемыхОбъектов".
//  Загрузка - Булево - управление режимом "ОбменДанными.Загрузка".
//  ДополнительныеСвойства - Неопределено, Структура - дополнительные параметры,
//  	см. ДополнительныеСвойстваНабораЗаписейНеОпределятьИзменениеБлокируемыеОбъекты().
//  
Процедура ДобавитьЗапись(СтруктураЗаписи, Загрузка = Ложь, ДополнительныеСвойства = Неопределено) Экспорт
	
	ОбменДаннымиСлужебный.ДобавитьЗаписьВРегистрСведений(
		СтруктураЗаписи,
		"ПубличныеИдентификаторыСинхронизируемыхОбъектов", 
		Загрузка,
		ДополнительныеСвойства);
	
КонецПроцедуры

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - см. структуру регистра "ПубличныеИдентификаторыСинхронизируемыхОбъектов".
//  Загрузка - Булево - управление режимом "ОбменДанными.Загрузка".
//
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСлужебный.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "ПубличныеИдентификаторыСинхронизируемыхОбъектов", Загрузка);
	
КонецПроцедуры

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПолучитьДанныеУстановленныхСоответствийПоОбъектам", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеУстановленныхСоответствийПоОбъектам(УзелИнформационнойБазы, ИменаОбъектовМетаданных)
	
	ПолученныеДанные = Новый Соответствие;
	
	ТекстыЗапроса  = Новый Массив;
	
	Для Каждого ПолноеИмя Из ИменаОбъектовМетаданных Цикл
		
		ТекстПодзапроса = СтрЗаменить(ШаблонЗапросаДляПолученияКоличестваСоответствийПоОбъектам(), "&ТаблицаОбъекта", ПолноеИмя);
		ТекстыЗапроса.Добавить(ТекстПодзапроса);
		
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат ПолученныеДанные;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПолученныеДанные;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Выборка.ТипОбъекта);
		Если Метаданные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеТипаОбъекта = Новый Структура;
		ДанныеТипаОбъекта.Вставить("КоличествоОбъектовВБазе",             Выборка.КоличествоОбъектовВБазе);
		ДанныеТипаОбъекта.Вставить("КоличествоУстановленныхСоответствий", Выборка.КоличествоУстановленныхСоответствий);
		
		ПолученныеДанные.Вставить(МетаданныеОбъекта.ПолноеИмя(), ДанныеТипаОбъекта);
		
	КонецЦикла;
	
	Возврат ПолученныеДанные;
	
КонецФункции

Функция ШаблонЗапросаДляПолученияКоличестваСоответствийПоОбъектам()
	
	Возврат "
	|ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.КоличествоОбъектовВБазе)   КАК КоличествоОбъектовВБазе,
	|	СУММА(ВложенныйЗапрос.УстановленныеСоответствия) КАК КоличествоУстановленныхСоответствий,
	|	ВложенныйЗапрос.ТипОбъекта                       КАК ТипОбъекта
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаОбъекта.Ссылка) КАК КоличествоОбъектовВБазе,
	|		0 КАК УстановленныеСоответствия,
	|		ТИПЗНАЧЕНИЯ(ТаблицаОбъекта.Ссылка) КАК ТипОбъекта
	|	ИЗ
	|		&ТаблицаОбъекта КАК ТаблицаОбъекта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|			ПО ТаблицаОбъекта.Ссылка = ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка
	|				И (ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелИнформационнойБазы)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТИПЗНАЧЕНИЯ(ТаблицаОбъекта.Ссылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаОбъекта.Ссылка),
	|		ТИПЗНАЧЕНИЯ(ТаблицаОбъекта.Ссылка)
	|	ИЗ
	|		&ТаблицаОбъекта КАК ТаблицаОбъекта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|			ПО ТаблицаОбъекта.Ссылка = ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка
	|				И (ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелИнформационнойБазы)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТИПЗНАЧЕНИЯ(ТаблицаОбъекта.Ссылка)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ТипОбъекта";

	
КонецФункции

#КонецОбласти

#КонецЕсли
